src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ПередачаВПереработку/ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВПереработку</name>
  <basedOn>Document.ВыпускПродукции</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПереработке</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <comment>Полуфабрикат или готовая продукция заказа, для которой передаётся материал (2.0.16.16); пусто - по правилу заказа</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <comment>Сколько ПФ/ГП ожидается из материала строки, в базовых единицах ПФ/ГП (2.0.16.17); 0 - по правилу заказа</comment>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует движения регистра по документу переработки.
//
// Единственная точка вызова - диспетчер РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения:
// передача сначала списывает сырьё со склада, и приход в переработку строится по этим
// расходам с их себестоимостью и издержками; поступление списывает сырьё у переработчика,
// а по сумме списания диспетчер приходует готовую продукцию на склад.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ПередачаВПереработку, ДокументОбъект.ПоступлениеИзПереработки - проводимый документ
//  ТЗТоварыССериями - ТаблицаЗначений - строки ТЧТовары документа (СерииИРазмещение.ОбъединитьТоварыССериями)
//
// Возвращаемое значение:
//  Булево - Ложь, если у переработчика не хватает сырья (сообщение уже выдано) или тип документа не поддержан
//
Функция СформироватьДвижения(ДокОбъект, ТЗТоварыССериями) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПередачаВПереработку") Тогда
		ОтразитьПередачу(ДокОбъект);
		Возврат Истина;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеИзПереработки") Тогда
		Возврат СписатьИзПереработки(ТЗТоварыССериями, ДокОбъект);
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Остатки сырья у переработчика на дату.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - переработчик
//  Дата - Дата, МоментВремени, Граница - момент получения остатков
//  Отбор - Структура, Неопределено - дополнительные условия по измерениям регистра:
//          ключи Номенклатура, Характеристика, Серия, ПередачаВПереработку
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Серия, Партия, ДатаПартии,
//                    ПередачаВПереработку, ЗаказПокупателя, Количество, Сумма, СуммаНДС;
//                    упорядочена по дате партии
//
Функция ПолучитьОстатки(Контрагент, Дата, Отбор = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Остатки.Номенклатура КАК Номенклатура,
	                      |	Остатки.Характеристика КАК Характеристика,
	                      |	Остатки.Серия КАК Серия,
	                      |	Остатки.Партия КАК Партия,
	                      |	Остатки.ДатаПартии КАК ДатаПартии,
	                      |	Остатки.ПередачаВПереработку КАК ПередачаВПереработку,
	                      |	Остатки.ЗаказПокупателя КАК ЗаказПокупателя,
	                      |	Остатки.КоличествоОстаток КАК Количество,
	                      |	Остатки.СуммаОстаток КАК Сумма,
	                      |	Остатки.СуммаНДСОстаток КАК СуммаНДС
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке.Остатки(&Дата, Контрагент = &Контрагент &УсловиеОтбора) КАК Остатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаПартии");
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	УсловиеОтбора = "";
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из Отбор Цикл
			УсловиеОтбора = УсловиеОтбора + " И " + КлючИЗначение.Ключ + " = &" + КлючИЗначение.Ключ;
			Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", УсловиеОтбора);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Списывает сырьё у переработчика по партиям (FIFO по дате партии) в разрезе
// Контрагент + Номенклатура + Характеристика + Серия. Если основание документа - конкретная
// передача в переработку, её партии списываются первыми. При недостаче выдаёт сообщение
// по каждой позиции и движения не формирует.
//
// Отбор по заказу (S5-A). Когда заказ документа определён (см. ЗаказСписания), в разбор попадают только
// партии ЭТОГО заказа и беззаказные, а партии чужого заказа недоступны: иначе поступление по одному заказу
// съедает партии другого заказа того же переработчика, а при частичной приёмке второе поступление списывает
// то же самое ещё раз. Беззаказные партии из отбора не выбрасываются - передача без заказа-основания обычна,
// и равенство заказу дало бы ложную недостачу при полном остатке у переработчика.
// Когда заказ не определён (у документа нет основания либо передача-основание не проведена и заказа у её
// движений нет), отбор по заказу не накладывается вовсе - поведение прежнее.
// Порядок разбора: сначала свой заказ, затем партии своей передачи, затем FIFO по дате партии.
//
// Параметры:
//  ТЗ - ТаблицаЗначений - строки списания с колонками Номенклатура, Характеристика, Серия, Количество
//  ДокОбъект - ДокументОбъект.ПоступлениеИзПереработки - проводимый документ
//
// Возвращаемое значение:
//  Булево - Истина, если сырья хватило и расход сформирован
//
Функция СписатьИзПереработки(ТЗ, ДокОбъект) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Номенклатура КАК Номенклатура,
	                      |	ВТ.Характеристика КАК Характеристика,
	                      |	ВТ.Серия КАК Серия,
	                      |	СУММА(ВТ.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТТовары
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ.Номенклатура,
	                      |	ВТ.Характеристика,
	                      |	ВТ.Серия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Движения.ПередачаВПереработку КАК ПередачаВПереработку
	                      |ПОМЕСТИТЬ ВТПередачиЗаказа
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке КАК Движения
	                      |ГДЕ
	                      |	Движения.Контрагент = &Контрагент
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |	И Движения.Активность
	                      |	И Движения.ЗаказПокупателя В (&Заказ, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Остатки.Номенклатура КАК Номенклатура,
	                      |	Остатки.Характеристика КАК Характеристика,
	                      |	Остатки.Серия КАК Серия,
	                      |	Остатки.Партия КАК Партия,
	                      |	Остатки.ДатаПартии КАК ДатаПартии,
	                      |	Остатки.ПередачаВПереработку КАК ПередачаВПереработку,
	                      |	Остатки.ЗаказПокупателя КАК ЗаказПокупателя,
	                      |	Остатки.КоличествоОстаток КАК Количество,
	                      |	Остатки.СуммаОстаток КАК Сумма,
	                      |	Остатки.СуммаНДСОстаток КАК СуммаНДС
	                      |ПОМЕСТИТЬ ВТОстатки
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке.Остатки(
	                      |			&ДатаОстатков,
	                      |			Контрагент = &Контрагент
	                      |				&УсловиеЗаказа
	                      |				И (Номенклатура, Характеристика, Серия) В
	                      |					(ВЫБРАТЬ
	                      |						ВТТовары.Номенклатура КАК Номенклатура,
	                      |						ВТТовары.Характеристика КАК Характеристика,
	                      |						ВТТовары.Серия КАК Серия
	                      |					ИЗ
	                      |						ВТТовары КАК ВТТовары)) КАК Остатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТТовары.Номенклатура КАК Номенклатура,
	                      |	ВТТовары.Характеристика КАК Характеристика,
	                      |	ВТТовары.Серия КАК Серия,
	                      |	ВТТовары.Количество КАК Количество,
	                      |	СУММА(ЕСТЬNULL(ВТОстатки.Количество, 0)) КАК КоличествоОстаток
	                      |ИЗ
	                      |	ВТТовары КАК ВТТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	                      |		ПО ВТТовары.Номенклатура = ВТОстатки.Номенклатура
	                      |			И ВТТовары.Характеристика = ВТОстатки.Характеристика
	                      |			И ВТТовары.Серия = ВТОстатки.Серия
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТТовары.Номенклатура,
	                      |	ВТТовары.Характеристика,
	                      |	ВТТовары.Серия,
	                      |	ВТТовары.Количество
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТОстатки.Номенклатура КАК Номенклатура,
	                      |	ВТОстатки.Характеристика КАК Характеристика,
	                      |	ВТОстатки.Серия КАК Серия,
	                      |	ВТОстатки.Партия КАК Партия,
	                      |	ВТОстатки.ДатаПартии КАК ДатаПартии,
	                      |	ВТОстатки.ПередачаВПереработку КАК ПередачаВПереработку,
	                      |	ВТОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	                      |	ВТОстатки.Количество КАК Количество,
	                      |	ВТОстатки.Сумма КАК Сумма,
	                      |	ВТОстатки.СуммаНДС КАК СуммаНДС,
	                      |	ВЫБОР
	                      |		КОГДА ВТОстатки.ПередачаВПереработку = &Передача
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ПорядокПередачи&ПолеПорядкаЗаказа
	                      |ИЗ
	                      |	ВТОстатки КАК ВТОстатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	&СортировкаПоЗаказуПорядокПередачи,
	                      |	ДатаПартии");
	Передача = ПередачаОснование(ДокОбъект);
	Заказ = ЗаказСписания(ДокОбъект, Передача);
	ПодставитьОтборПоЗаказу(Запрос, Заказ);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(ДокОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Передача", Передача);
	Результат = Запрос.ВыполнитьПакет();
	ТЗКонтроль = Результат[4].Выгрузить();
	ТЗПартии = Результат[5].Выгрузить();
	Если ЕстьНедостача(ДокОбъект, ТЗКонтроль, Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого Стр Из ТЗКонтроль Цикл
		СписатьПартии(ДокОбъект, Стр, ТЗПартии);
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Себестоимость сырья, списанного у переработчика документом.
//
// Параметры:
//  Док - ДокументСсылка.ПоступлениеИзПереработки - регистратор
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Серия, Количество, Сумма, СуммаНДС по расходам документа
//
Функция ПолучитьСебестоимостьПоДокументу(Док) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыВПереработке.Номенклатура КАК Номенклатура,
	                      |	ТоварыВПереработке.Характеристика КАК Характеристика,
	                      |	ТоварыВПереработке.Серия КАК Серия,
	                      |	СУММА(ТоварыВПереработке.Количество) КАК Количество,
	                      |	СУММА(ТоварыВПереработке.Сумма) КАК Сумма,
	                      |	СУММА(ТоварыВПереработке.СуммаНДС) КАК СуммаНДС
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке КАК ТоварыВПереработке
	                      |ГДЕ
	                      |	ТоварыВПереработке.Регистратор = &Регистратор
	                      |	И ТоварыВПереработке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВПереработке.Номенклатура,
	                      |	ТоварыВПереработке.Характеристика,
	                      |	ТоварыВПереработке.Серия");
	Запрос.УстановитьПараметр("Регистратор", Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Есть ли расход партий передачи в переработку от других документов - поступлений из переработки по ней или, по FIFO,
// по другим передачам того же переработчика (E12.3b). Отбор - по переработчику передачи в базе (первое измерение
// индекса регистра). Читается служебно: пишут передачу роли без права на регистр.
//
// Параметры:
//  Передача - ДокументСсылка.ПередачаВПереработку - передача.
//
// Возвращаемое значение:
//  Булево - Истина, если партии передачи уже списывались.
//
Функция ЕстьСписаниеПоПередаче(Передача) Экспорт
	Если Не ЗначениеЗаполнено(Передача) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Движения.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке КАК Движения
	                      |ГДЕ
	                      |	Движения.Контрагент В
	                      |			(ВЫБРАТЬ
	                      |				Передачи.Контрагент КАК Контрагент
	                      |			ИЗ
	                      |				Документ.ПередачаВПереработку КАК Передачи
	                      |			ГДЕ
	                      |				Передачи.Ссылка = &Передача)
	                      |	И Движения.ПередачаВПереработку = &Передача
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |	И Движения.Активность
	                      |	И Движения.Регистратор <> &Передача");
	Запрос.УстановитьПараметр("Передача", Передача);
	// BSLLS:SetPrivilegedMode-off - наружу уходит только признак, данные регистра не возвращаются.
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьНедостача(ДокОбъект, ТЗКонтроль, Заказ)
	// Сообщает по каждой позиции, которой не хватает у переработчика.
	Результат = Ложь;
	Для Каждого Стр Из ТЗКонтроль Цикл
		Если Стр.Количество > Стр.КоличествоОстаток Тогда
			Результат = Истина;
			СообщитьОНедостаче(ДокОбъект, Стр, Заказ);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Заказ, партии которого списываются. Берётся из ПРИХОДНЫХ ДВИЖЕНИЙ передачи-основания, а не пересчётом по цепочке
// оснований: приход хранит заказ, посчитанный при проведении передачи, а шапку проведённой передачи можно перезаписать
// без перепроведения - пересчёт разошёлся бы с партиями, и отбор не нашёл бы собственное сырьё.
// ПЕРВЫЕ 1 законно: ОтразитьПередачу вычисляет заказ один раз на весь документ, построчно он не считается.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ПоступлениеИзПереработки - проводимый документ.
//  Передача  - ДокументСсылка.ПередачаВПереработку - передача-основание, см. ПередачаОснование.
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказПокупателя - пустая ссылка, если заказ документа не определён.
//
Функция ЗаказСписания(ДокОбъект, Передача)
	Если ТипЗнч(ДокОбъект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат ДокОбъект.Основание;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Передача) Тогда
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Движения.ЗаказПокупателя КАК ЗаказПокупателя
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке КАК Движения
	                      |ГДЕ
	                      |	Движения.Регистратор = &Передача
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |	И Движения.Активность");
	Запрос.УстановитьПараметр("Передача", Передача);
	ТЗЗаказов = Запрос.Выполнить().Выгрузить();
	Если ТЗЗаказов.Количество() = 1 Тогда
		Возврат ТЗЗаказов[0].ЗаказПокупателя;
	КонецЕсли;
	Если ТЗЗаказов.Количество() > 1 Тогда
		// Сегодня быть не может: ОтразитьПередачу считает заказ один раз на весь документ. Если появится построчный
		// заказ, отбор сузить нечем - честно уходим в прежнее поведение, а не выбираем первый попавшийся.
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;
	// Передача ещё не проведена: движений нет, заказ берём из её основания.
	Заказ = РаботаСДокументами.ПолучитьДокументРодительПоТипу(Тип("ДокументСсылка.ЗаказПокупателя"), Передача);
	Возврат ?(Заказ = Неопределено, Документы.ЗаказПокупателя.ПустаяСсылка(), Заказ);
КонецФункции

// Подставляет в текст запроса отбор и порядок по заказу; заказ не определён - и то, и другое пусто, запрос прежний.
//
// Параметры:
//  Запрос - Запрос - запрос разбора остатков.
//  Заказ  - ДокументСсылка.ЗаказПокупателя - см. ЗаказСписания.
//
Процедура ПодставитьОтборПоЗаказу(Запрос, Заказ)
	Если ЗначениеЗаполнено(Заказ) Тогда
		// Отбор идёт по ПЕРЕДАЧЕ, а не по измерению ЗаказПокупателя самой строки остатка. Причина - историческая
		// асимметрия: обработчик обновления волны 12 проставил заказ по цепочке оснований РЕГИСТРАТОРА, поэтому у
		// старого расхода заказ может не совпасть с заказом прихода той же партии. Отбор по заказу строки разорвал
		// бы такую пару: плюс остался бы в выборке, минус выпал, и контроль увидел бы остаток, которого нет.
		// Измерение ПередачаВПереработку расход копирует из самой партии (СписатьПартии -> ДобавитьДвижение), поэтому
		// по нему отфильтрованный срез остаётся сбалансированным на любых данных.
		УсловиеЗаказа = "
		|				И (ПередачаВПереработку В
		|						(ВЫБРАТЬ
		|							ВТПередачиЗаказа.ПередачаВПереработку
		|						ИЗ
		|							ВТПередачиЗаказа КАК ВТПередачиЗаказа)
		|					ИЛИ ПередачаВПереработку = ЗНАЧЕНИЕ(Документ.ПередачаВПереработку.ПустаяСсылка))";
		ПолеПорядка = ",
		|	ВЫБОР
		|		КОГДА ВТОстатки.ЗаказПокупателя = &Заказ
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПорядокЗаказа";
		Сортировка = "ПорядокЗаказа,
		|	";
	Иначе
		УсловиеЗаказа = "";
		ПолеПорядка = "";
		Сортировка = "";
	КонецЕсли;
	// Параметр ставится всегда: временная таблица передач заказа есть в обеих ветках, чтобы индексы пакета не плавали.
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗаказа", УсловиеЗаказа);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеПорядкаЗаказа", ПолеПорядка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СортировкаПоЗаказу", Сортировка);
КонецПроцедуры

Процедура СписатьПартии(ДокОбъект, Стр, ТЗПартии)
	// Списывает количество строки с партий позиции в порядке ТЗПартии (FIFO); остатки партий уменьшает.
	КоличествоКСписанию = Стр.Количество;
	Отбор = Новый Структура("Номенклатура, Характеристика, Серия");
	ЗаполнитьЗначенияСвойств(Отбор, Стр);
	Для Каждого СтрПартия Из ТЗПартии.НайтиСтроки(Отбор) Цикл
		Если КоличествоКСписанию = 0 Тогда
			Прервать;
		КонецЕсли;
		Если СтрПартия.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Количество = Мин(КоличествоКСписанию, СтрПартия.Количество);
		Сумма = ?(Количество = СтрПартия.Количество, СтрПартия.Сумма,
			Окр(СтрПартия.Сумма / СтрПартия.Количество * Количество, РазрядностьСуммы()));
		СуммаНДС = РегистрыНакопления.ТоварыВНаличии.ДоляСуммы(СтрПартия.СуммаНДС, Сумма, СтрПартия.Сумма);
		ДобавитьДвижение(ДокОбъект, ВидДвиженияНакопления.Расход, СтрПартия, Количество, Сумма, СуммаНДС);
		КоличествоКСписанию = КоличествоКСписанию - Количество;
		СтрПартия.Количество = СтрПартия.Количество - Количество;
		СтрПартия.Сумма = СтрПартия.Сумма - Сумма;
		СтрПартия.СуммаНДС = СтрПартия.СуммаНДС - СуммаНДС;
	КонецЦикла;
КонецПроцедуры

Процедура ОтразитьПередачу(ДокОбъект)
	// Приход в переработку повторяет расходы со склада по партиям; себестоимость партии
	// увеличивается на списанные с неё издержки (ДополнительныеРасходы).
	Движения = ДокОбъект.Движения;
	ОтборРасход = Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход);
	ТЗРасходы = Движения.ТоварыВНаличии.Выгрузить().Скопировать(ОтборРасход,
		"Номенклатура, Характеристика, Серия, Партия, ДатаПартии, Количество, Сумма, СуммаНДС");
	ТЗРасходы.Свернуть("Номенклатура, Характеристика, Серия, Партия, ДатаПартии", "Количество, Сумма, СуммаНДС");
	ТЗИздержки = Движения.ДополнительныеРасходы.Выгрузить().Скопировать(ОтборРасход,
		"Номенклатура, Характеристика, Серия, Партия, Сумма, СуммаНДС");
	ТЗИздержки.Свернуть("Номенклатура, Характеристика, Серия, Партия", "Сумма, СуммаНДС");
	Заказ = РаботаСДокументами.ПолучитьДокументРодительПоТипу(
		Тип("ДокументСсылка.ЗаказПокупателя"), ДокОбъект.Основание);
	Для Каждого Стр Из ТЗРасходы Цикл
		Отбор = Новый Структура("Номенклатура, Характеристика, Серия");
		ЗаполнитьЗначенияСвойств(Отбор, Стр);
		Отбор.Вставить("Партия", Стр.Партия);
		Сумма = Стр.Сумма;
		СуммаНДС = Стр.СуммаНДС;
		Для Каждого СтрИздержки Из ТЗИздержки.НайтиСтроки(Отбор) Цикл
			Сумма = Сумма + СтрИздержки.Сумма;
			СуммаНДС = СуммаНДС + СтрИздержки.СуммаНДС;
		КонецЦикла;
		Партия = Новый Структура("Номенклатура, Характеристика, Серия, Партия, ДатаПартии");
		ЗаполнитьЗначенияСвойств(Партия, Стр);
		Партия.Вставить("ПередачаВПереработку", ДокОбъект.Ссылка);
		Партия.Вставить("ЗаказПокупателя", Заказ);
		ДобавитьДвижение(ДокОбъект, ВидДвиженияНакопления.Приход, Партия, Стр.Количество, Сумма, СуммаНДС);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьДвижение(ДокОбъект, ВидДвижения, Партия, Количество, Сумма, СуммаНДС)
	// Партия - строка таблицы или структура с измерениями регистра (кроме контрагента).
	НС = ДокОбъект.Движения.ТоварыВПереработке.Добавить();
	НС.ВидДвижения = ВидДвижения;
	НС.Период = ДокОбъект.Дата;
	НС.Контрагент = ДокОбъект.Контрагент;
	ЗаполнитьЗначенияСвойств(НС, Партия,
		"Номенклатура, Характеристика, Серия, Партия, ДатаПартии, ПередачаВПереработку, ЗаказПокупателя");
	НС.Количество = Количество;
	НС.Сумма = Сумма;
	НС.СуммаНДС = СуммаНДС;
КонецПроцедуры

Функция ПередачаОснование(ДокОбъект)
	// Передача, партии которой списываются первыми; пустая ссылка - обычный FIFO.
	Если ТипЗнч(ДокОбъект.Основание) = Тип("ДокументСсылка.ПередачаВПереработку") Тогда
		Возврат ДокОбъект.Основание;
	КонецЕсли;
	Возврат Документы.ПередачаВПереработку.ПустаяСсылка();
КонецФункции

Процедура СообщитьОНедостаче(ДокОбъект, Стр, Заказ)
	Шаблон = НСтр("ru = 'У переработчика «%1» недостаточно (%2): нужно %3, остаток %4, не хватает %5';
		|fr = 'Le sous-traitant « %1 » n''a pas assez de (%2) : requis %3, reste %4, manque %5';
		|en = 'Processor ""%1"" does not have enough (%2): required %3, in stock %4, short by %5';
		|es = 'El procesador «%1» no tiene suficiente (%2): necesario %3, existencia %4, faltan %5'");
	Представление = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, Стр.Серия);
	Нужно = СокрЛП(Стр.Количество);
	Остаток = СокрЛП(Стр.КоличествоОстаток);
	НеХватает = СокрЛП(Стр.Количество - Стр.КоличествоОстаток);
	ТекстОшибки = СтрШаблон(Шаблон, ДокОбъект.Контрагент, Представление, Нужно, Остаток, НеХватает);
	Если ЗначениеЗаполнено(Заказ) Тогда
		// Без этой фразы «нужно 5, остаток 0» при полном складе у переработчика читается как ошибка программы,
		// и штатным обходом становится очистка основания документа.
		ШаблонЗаказа = НСтр("ru = ' Считаются партии заказа «%1» и партии без заказа; партии других заказов не берутся.';
			|fr = ' Seuls les lots de la commande « %1 » et les lots sans commande sont pris en compte.';
			|en = ' Only batches of order ""%1"" and batches without an order are used.';
			|es = ' Solo se usan los lotes del pedido «%1» y los lotes sin pedido.'");
		ТекстОшибки = ТекстОшибки + СтрШаблон(ШаблонЗаказа, Заказ);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокОбъект.Ссылка);
КонецПроцедуры

Функция РазрядностьСуммы()
	Возврат 2;
КонецФункции

#КонецОбласти
